/*
 * process.h
 * 图像处理类
 * Created on: 2012-9-26
 * Author: john
 */
#include <cv.h>
#include <highgui.h>
/*======================================================================
 灰度级图片二值化
 src 图片
 threshold 临界阀值
 ====================================================================== */
void binarizationByOPCV(IplImage *src, int threshold) ;
/*======================================================================
 灰度级图片中值去噪
 src 图片
 ====================================================================== */
void denoisingByOPCV(IplImage *src);


