/*
 * threshold.h
 * 图像阀值计算类
 * Created on: 2012-9-26
 * Author: john
 */
#include <stdio.h>
#include "cv.h"
#include "highgui.h"

/*======================================================================
 OTSU 大律法 动态计算灰度图像阀值
 ======================================================================*/
int thresholdByOTSU(IplImage *image);

/*======================================================================
 加权最大方差 动态计算灰度图像求阀值
 ======================================================================*/
int thresholdBYVariance(IplImage *src);
/*======================================================================
 最大熵 动态计算灰度图像求阀值
 ====================================================================== */
int thresholdBYMaxEntropy(IplImage *src);
